{
  "items": [
    {
      "title": "1914-06-28",
      "cardTitle": "Assassination of Archduke Franz Ferdinand",
      "cardSubtitle": "Sarajevo spark",
      "url": "https://en.wikipedia.org/wiki/Assassination_of_Archduke_Franz_Ferdinand",
      "cardDetailedText": "On June 28, 1914, Archduke Franz Ferdinand of Austria and his wife, Sophie, Duchess of Hohenberg, were assassinated in Sarajevo by Gavrilo Princip, a Serbian nationalist. This pivotal event ignited the July Crisis, a series of diplomatic maneuvers and escalations among the European powers, ultimately leading to the outbreak of World War I. The assassination is widely regarded as the immediate trigger for the devastating global conflict that followed."
    },
    {
      "title": "1914-07-28",
      "cardTitle": "Austria-Hungary declares war on Serbia",
      "cardSubtitle": "Official start of WWI",
      "url": "https://en.wikipedia.org/wiki/World_War_I",
      "cardDetailedText": "Exactly one month after the assassination of Archduke Franz Ferdinand, Austria-Hungary declared war on Serbia. This declaration marked the official beginning of World War I, transforming a regional dispute into a wider European conflict. Russia, committed to defending Serbia, immediately began to mobilize its forces, setting off a chain reaction among the intricately linked European alliances."
    },
    {
      "title": "1914-08-01",
      "cardTitle": "Germany declares war on Russia",
      "cardSubtitle": "Alliance escalation",
      "url": "https://en.wikipedia.org/wiki/World_War_I",
      "cardDetailedText": "Following Russia's mobilization in support of Serbia, Germany, an ally of Austria-Hungary, declared war on Russia. This act significantly escalated the conflict beyond the Balkans, drawing in major European powers. Russia's full mobilization signaled its commitment to the war, setting the stage for a continent-wide struggle."
    },
    {
      "title": "1914-08-03",
      "cardTitle": "Germany declares war on France & invades Belgium",
      "cardSubtitle": "Western Front opens",
      "url": "https://en.wikipedia.org/wiki/World_War_I",
      "cardDetailedText": "Germany declared war on France, a key ally of Russia, and simultaneously invaded neutral Belgium. The invasion of Belgium was part of the Schlieffen Plan, a German military strategy designed to quickly outflank French defenses and achieve a swift victory on the Western Front. This violation of Belgian neutrality directly led to Britain's entry into the war the following day."
    },
    {
      "title": "1914-08-04",
      "cardTitle": "United Kingdom enters the war",
      "cardSubtitle": "Britain declares war",
      "url": "https://en.wikipedia.org/wiki/World_War_I",
      "cardDetailedText": "The United Kingdom declared war on Germany after Germany's invasion of Belgium. Britain had guaranteed Belgium's neutrality by treaty, and Germany's blatant disregard for this agreement provided the casus belli for Britain's entry into the conflict. This brought the full might of the British Empire into the war, solidifying the two main opposing alliances: the Central Powers and the Allied Powers."
    },
    {
      "title": "1914-09-06",
      "cardTitle": "First Battle of the Marne begins",
      "cardSubtitle": "Paris threatened then saved",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The First Battle of the Marne was a crucial engagement on the Western Front where Allied forces, primarily French and British, successfully halted the rapid German advance toward Paris. This battle marked the end of the war of movement and the beginning of entrenched warfare, defining the stalemate that would characterize the Western Front for the next several years."
    },
    {
      "title": "1914-11-05",
      "cardTitle": "Britain & France declare war on Ottoman Empire",
      "cardSubtitle": "War expands to Middle East",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "Britain and France officially declared war on the Ottoman Empire. This declaration significantly expanded the geographical scope of World War I, opening new fronts in the Middle East, including the Gallipoli campaign and engagements in Mesopotamia. The Ottoman Empire's entry on the side of the Central Powers brought new strategic considerations and complexities to the global conflict."
    },
    {
      "title": "1915-04-22",
      "cardTitle": "Second Battle of Ypres begins",
      "cardSubtitle": "First large-scale gas attack",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The Second Battle of Ypres began with a significant and terrifying development in warfare: the first large-scale use of poison gas. German forces released chlorine gas against Allied troops, causing widespread panic, casualties, and a dramatic shift in the nature of combat. This event ushered in a new era of chemical warfare, forever altering the tactics and horrors of World War I."
    },
    {
      "title": "1915-04-25",
      "cardTitle": "Gallipoli landings",
      "cardSubtitle": "ANZAC campaign",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "Allied forces, primarily consisting of Australian and New Zealand Army Corps (ANZAC) troops, landed on the Gallipoli Peninsula in an attempt to open a new front and secure a sea route to Russia. This ambitious campaign, however, quickly devolved into a costly stalemate against entrenched Ottoman defenses. The Gallipoli campaign resulted in a disastrous nine-month engagement with over 200,000 Allied casualties, becoming a symbol of military miscalculation and immense sacrifice."
    },
    {
      "title": "1915-05-07",
      "cardTitle": "Sinking of the Lusitania",
      "cardSubtitle": "US casualties spark outrage",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The British ocean liner RMS Lusitania was torpedoed and sunk by a German U-boat off the coast of Ireland. The attack resulted in the deaths of nearly 1,200 people, including 128 American citizens. This act of unrestricted submarine warfare caused widespread outrage in the United States and significantly swayed American public opinion toward joining the Allied cause, despite the U.S. remaining neutral for two more years."
    },
    {
      "title": "1916-02-21",
      "cardTitle": "Battle of Verdun begins",
      "cardSubtitle": "Longest battle of WWI",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The Battle of Verdun, one of the longest and most brutal battles in human history, commenced between French and German forces. Fought on the hills north of Verdun-sur-Meuse, France, the battle lasted for an astonishing 10 months, characterized by relentless shelling and fierce close-quarters combat. By its end, the battle inflicted over 700,000 casualties on both sides, becoming a symbol of the futility and immense cost of attrition warfare on the Western Front."
    },
    {
      "title": "1916-05-31",
      "cardTitle": "Battle of Jutland",
      "cardSubtitle": "Largest naval clash",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The Battle of Jutland was the only major naval battle of World War I, fought between the British Royal Navy's Grand Fleet and the German Empire's High Seas Fleet. While both sides claimed victory, the engagement was tactically inconclusive, with neither fleet gaining decisive control of the North Sea. Despite the heavy losses, the British Grand Fleet maintained its numerical superiority, effectively keeping the German fleet confined to its ports for the remainder of the war."
    },
    {
      "title": "1916-07-01",
      "cardTitle": "Battle of the Somme begins",
      "cardSubtitle": "Britain’s bloodiest day",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The Battle of the Somme, another immense and devastating offensive on the Western Front, began with a staggering number of casualties for the British forces, with over 57,000 suffering casualties on the first day alone. This ambitious Allied offensive aimed to break through the German lines but instead resulted in a protracted and brutal struggle, ultimately ending with over 1 million combined casualties for both sides. The Somme became synonymous with the horrific attrition and technological limitations of trench warfare."
    },
    {
      "title": "1917-03-15",
      "cardTitle": "Tsar Nicholas II abdicates",
      "cardSubtitle": "Russian Revolution begins",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "Amidst widespread unrest, food shortages, and military setbacks, Tsar Nicholas II abdicated the Russian throne. This event marked the beginning of the Russian Revolution, a series of tumultuous political upheavals that would ultimately lead to the collapse of the Tsarist autocracy and the rise of the Bolsheviks. The revolution profoundly impacted the course of WWI, eventually leading to Russia's withdrawal from the conflict, freeing up German forces for the Western Front."
    },
    {
      "title": "1917-04-06",
      "cardTitle": "United States declares war on Germany",
      "cardSubtitle": "Allied reinforcements arrive",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "Driven by Germany's resumption of unrestricted submarine warfare and the revelation of the Zimmermann Telegram, a secret German proposal to Mexico, the United States officially declared war on Germany. America's entry into the war provided a crucial boost to the exhausted Allied powers, bringing much-needed fresh troops, industrial capacity, and financial resources. This influx of support would prove instrumental in turning the tide on the Western Front."
    },
    {
      "title": "1917-11-20",
      "cardTitle": "Battle of Cambrai",
      "cardSubtitle": "First mass use of tanks",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The Battle of Cambrai marked a significant turning point in mechanized warfare, as British forces launched the first large-scale, coordinated attack using tanks. The element of surprise, coupled with the effective deployment of nearly 400 tanks, allowed for initial breakthroughs of the formidable Hindenburg Line. While the gains were eventually reversed, Cambrai demonstrated the immense potential of tanks to overcome entrenched defenses and signaled a crucial shift in military tactics for future conflicts."
    },
    {
      "title": "1918-09-26",
      "cardTitle": "Meuse-Argonne Offensive begins",
      "cardSubtitle": "Final Allied push",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "The Meuse-Argonne Offensive, the largest engagement in American military history at that time, commenced as part of the wider Hundred Days Offensive. This major Allied push involved over a million American troops fighting alongside French forces, aiming to break through the heavily fortified German lines in the Argonne Forest and along the Meuse River. The offensive ultimately led to a decisive breakthrough on the Western Front, severely weakening German resistance and significantly contributing to the rapid collapse of the German war effort and hastening their surrender."
    },
    {
      "title": "1918-11-11",
      "cardTitle": "Armistice signed",
      "cardSubtitle": "End of hostilities",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "At 5:00 AM on November 11, 1918, the Armistice of Compiègne was signed between the Allies and Germany in a railway carriage in the Compiègne Forest, France. This historic agreement brought an end to all hostilities on the Western Front, with fighting officially ceasing at 11:00 AM on the 11th day of the 11th month. The signing of the armistice effectively marked the end of World War I, ushering in a period of fragile peace and negotiations for a formal treaty."
    },
    {
      "title": "1919-06-28",
      "cardTitle": "Treaty of Versailles signed",
      "cardSubtitle": "Peace concluded",
      "url": "https://www.britannica.com/list/timeline-of-world-war-i",
      "cardDetailedText": "On June 28, 1919, exactly five years after the assassination of Archduke Franz Ferdinand, the Treaty of Versailles was signed in the Palace of Versailles, France. This monumental treaty formally ended the war between Germany and the Allied powers. The treaty imposed severe reparations on Germany, drastically reduced its military, and resulted in significant territorial losses. While intended to ensure lasting peace, the harsh terms of the Treaty of Versailles are often cited as a contributing factor to future conflicts, including World War II."
    }
  ]
}